CUDiningPair/app/controllers/registrations_controller.rb

INSERT INTO "users" ("uni", "password_digest", "email", "verification_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    # Automatically set the email value
    @user.email = "#{@user.uni}@columbia.edu"

    @user.verification_code = rand.to_s[2..7]  # Generate a 6-digit random number

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."verification_code" IS NULL LIMIT 1
---
  def verify
    user = User.find_by(verification_code: params[:verification_code])