CUDiningPair/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "lc3542"]]
---
  def create
    user = User.find_by(uni: params[:uni])