CUDiningPair/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uni" IS NULL LIMIT 1
---
  def create
    user = User.find_by(uni: params[:uni])